{"class_name": "Functional", "config": {"name": "functional_25", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 5, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_13"}, "name": "input_13", "inbound_nodes": []}, {"class_name": "TCN", "config": {"name": "TCN", "trainable": true, "dtype": "float32", "nb_filters": 20, "kernel_size": 6, "nb_stacks": 1, "dilations": [1, 2, 4, 8, 16], "padding": "causal", "use_skip_connections": true, "dropout_rate": 0.0, "return_sequences": false, "activation": "relu", "use_batch_norm": false, "use_layer_norm": false, "use_weight_norm": true, "kernel_initializer": "he_normal"}, "name": "TCN", "inbound_nodes": [[["input_13", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_12", "trainable": true, "dtype": "float32", "units": 20, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_12", "inbound_nodes": [[["TCN", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_12", "trainable": true, "dtype": "float32", "activation": "softmax"}, "name": "activation_12", "inbound_nodes": [[["dense_12", 0, 0, {}]]]}], "input_layers": [["input_13", 0, 0]], "output_layers": [["activation_12", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}